# 확률

# 표본공간 : 
# 확률 실험으로부터 출현 가능한 모든 결과들의 모임
# 라틴 어 옴? 으로 표시

# 사건:
# 표본 공간 내 각 원소들(출현가능한 결과들)의 부분집합 
# 영어 대문자로 표시
#  
# 사건의 연산
# 합: A 또는 B 에서 일어나는 사건
# 곱: A 와 B 에서 동시에
# 여: A 가 발생하지 않을 사건
# 배반: A 와 B 가 겹치지 않는, 동시에 발생하지 않는 사건
# 독립: A 의 발생이 B 에, 즉 서로에게 영향을 끼치지 않음
# 
# 확률 공리 (공리적 확률)
# : P(A) - A 가 일어날 Probability : 0<=P(A)<= 1
# : 반드시 일어나는 것은 1 (P(옴)=1)
# : 서로 배반인 사건들은 합하여 전체 확률 P(A) 를 만든다 (배반이 아닐시는 곱함)
# 
# 
# # 확률 법칙
# 덧셈 : P(A) + P(B) - P(A 교 B)
# 곱셈 : 
#   P(A|B) = P(A교B) / P(B)
#   P(A교B) = P(B) * P(A|B) = P(A) * P(B|A)
# 여사건 : P(A여) = 1 - P(A)


# 확률변수
# 확률변수 X 의 평균 -> 기댓값 E(X) = Sigma(x*P(X=x))
# 확률변수의 분산 -> Var(X) = x^2 *P(X=x) - (E(x))^2 = E(X^2) - E(X)^2
# 
# 
# 
# 










